html/thm-and-proof.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Theorem and proof environments</title>
<!-- 2018-01-31 Wed 12:13 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="jde27" />
<meta name='viewport' content='width=device-width,
initial-scale=1.0'> <meta name='keywords' content='Jonny Evans,
mathematics, geometry, UCL'> <meta name='description'
content='Blog of the UCL-based mathematician Jonny Evans'>
<meta name='author' content='Jonny Evans'> 
<link rel='stylesheet' type='text/css' href='../aux/style.css'/>
</head>
<body>
<div id="preamble" class="status">
<div class='banner'>
<a href='index.html'>Blog index</a> | <a href='http://www.homepages.ucl.ac.uk/~ucahjde'>Homepage</a></div>
</div>
<div id="content">
<h1 class="title">Theorem and proof environments</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Theorem and proof environments in CSS</h2>
<div class="outline-text-2" id="text-1">
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2017-09-12 Tue]</span></span>
</p>

<p>
Here is a nice idea from <a href="http://drz.ac/2013/01/17/latex-theorem-like-environments-for-the-web/">Dr Z.ac</a>, the blog of Zachary Harmany which
I'm planning to use to enhance the mathematical usability of my blog.
</p>

<p>
In org-mode you can create theorem/proof-like environments as follows:
</p>

<pre class="example">
#+BEGIN_thm
Let $X$ be a compact space and $Y$ be a Hausdorff space. Any continuous
bijection $F\colon X\to Y$ is a homeomorphism.
#+END_thm
#+BEGIN_proof
It suffices to show that the image of a closed set $V\subset X$ is closed.
A closed set of a compact space is compact,
and the continuous image of a compact set is compact,
hence $F(V)$ is compact.
A compact subset of a Hausdorff space is closed,
therefore $F(V)$ is closed.
#+END_proof
</pre>

<p>
When you export to LaTeX this will produce theorem and proof
environments as usual. When you export to HTML, it will create a div
tag of class "Theorem". Here's how to use CSS to style this so that it
actually has an appropriate "Theorem" label (and end-of-proof symbol).
</p>

<pre class="example">
.thm{
    display:block;
    margin-left:10px;
    margin-bottom:20px;
    font-style:normal;
}
.thm:before{
    content:"Theorem.\00a0\00a0";
    float:left;
    font-weight:bold;
}

.proof{
    display:block;
    margin-left:10px;
    margin-bottom:30px;
    font-style:normal;
}
.proof:before{
    content:'Proof.\00a0\00a0';
    float:left;
    font-weight:bold;
}
.proof:after{
    content:"\25FC";
    float:right;
}
</pre>

<p>
to get:
</p>

<div class="thm">
<p>
Let \(X\) be a compact space and \(Y\) be a Hausdorff space. Any continuous
bijection \(F\colon X\to Y\) is a homeomorphism.
</p>

</div>
<div class="proof">
<p>
It suffices to show that the image of a closed set \(V\subset X\) is closed.
A closed set of a compact space is compact,
and the continuous image of a compact set is compact,
hence \(F(V)\) is compact.
A compact subset of a Hausdorff space is closed,
therefore \(F(V)\) is closed.
</p>

</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<div class='bottomblock'><a class='cc' href='https://creativecommons.org/licenses/by-sa/4.0/legalcode'>CC-BY-SA</a>, Jonny Evans 2017</div>
</div>
</body>
</html>
